temp/v2/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @page_title = '文章列表'
    @posts = Post.all;

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "d"], ["created_at", "2015-01-12 06:15:41.704453"], ["title", "das"], ["updated_at", "2015-01-12 06:15:41.704453"], ["user_id", 5]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "updated_at" = ?, "user_id" = ? WHERE "posts"."id" = 1  [["updated_at", "2015-01-12 06:38:26.079178"], ["user_id", 8]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)