temp/v2/app/controllers/users_controller.rb

  def index
    @page_title = '使用者列表'
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("account", "created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["account", ""], ["created_at", "2015-01-09 11:09:47.131714"], ["name", ""], ["password", ""], ["updated_at", "2015-01-09 11:09:47.131714"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "account" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["account", "AS"], ["password", "D"], ["updated_at", "2015-01-12 02:51:21.362482"]]

  def destroy
    if @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]