temp/v2/app/controllers/user_posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "da"], ["created_at", "2015-01-14 03:16:41.727511"], ["title", "ㄎ"], ["updated_at", "2015-01-14 03:16:41.727511"], ["user_id", 8]]
---
  def create
    @post = @user.posts.build( post_params )
    if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
  def enable
    @post = @user.posts.find( params[:post_id] )

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 8]]
---
  def find_user
    @user = User.find( params[:user_id] )

SELECT  "posts".* FROM "posts"  WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT 1  [["user_id", 8], ["id", 2]]
---
  def find_post
    @post = @user.posts.find( params[:id] )