temp/v2/app/views/user_infos/show.slim

      th 文章數
      td = @user.posts.count
---
SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 2]]