temp/v2/app/views/user_posts/index.slim

SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = ?  [["user_id", 8]]
---
      th 文章數
      td = @user.posts.count